RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_trng.h
/* Bit fields for TRNG INITWAITVAL */
#define _TRNG_INITWAITVAL_RESETVALUE                 0x000003FFUL                           /**< Default value for TRNG_INITWAITVAL */
#define _TRNG_INITWAITVAL_MASK                       0x000003FFUL                           /**< Mask for TRNG_INITWAITVAL */
#define _TRNG_INITWAITVAL_VALUE_SHIFT                0                                      /**< Shift value for TRNG_VALUE */
#define _TRNG_INITWAITVAL_VALUE_MASK                 0x3FFUL                                /**< Bit mask for TRNG_VALUE */
#define _TRNG_INITWAITVAL_VALUE_DEFAULT              0x000003FFUL                           /**< Mode DEFAULT for TRNG_INITWAITVAL */
#define TRNG_INITWAITVAL_VALUE_DEFAULT               (_TRNG_INITWAITVAL_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_INITWAITVAL */

/* Bit fields for TRNG FIFO */
#define _TRNG_FIFO_RESETVALUE                        0x00000000UL                    /**< Default value for TRNG_FIFO */
#define _TRNG_FIFO_MASK                              0xFFFFFFFFUL                    /**< Mask for TRNG_FIFO */
#define _TRNG_FIFO_VALUE_SHIFT                       0                               /**< Shift value for TRNG_VALUE */
#define _TRNG_FIFO_VALUE_MASK                        0xFFFFFFFFUL                    /**< Bit mask for TRNG_VALUE */
#define _TRNG_FIFO_VALUE_DEFAULT                     0x00000000UL                    /**< Mode DEFAULT for TRNG_FIFO */
#define TRNG_FIFO_VALUE_DEFAULT                      (_TRNG_FIFO_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_FIFO */

/* Bit fields for TRNG CORECLKCONTROL */
#define _TRNG_CORECLKCONTROL_RESETVALUE              0x00000000UL                                     /**< Default value for TRNG_CORECLKCONTROL */
#define _TRNG_CORECLKCONTROL_MASK                    0x00000071UL                                     /**< Mask for TRNG_CORECLKCONTROL */
#define TRNG_CORECLKCONTROL_CORECLKDIS               (0x1UL << 0)                                     /**< Core Clock Disable */
#define _TRNG_CORECLKCONTROL_CORECLKDIS_SHIFT        0                                                /**< Shift value for TRNG_CORECLKDIS */
#define _TRNG_CORECLKCONTROL_CORECLKDIS_MASK         0x1UL                                            /**< Bit mask for TRNG_CORECLKDIS */
#define _TRNG_CORECLKCONTROL_CORECLKDIS_DEFAULT      0x00000000UL                                     /**< Mode DEFAULT for TRNG_CORECLKCONTROL */
#define _TRNG_CORECLKCONTROL_CORECLKDIS_ENABLED      0x00000000UL                                     /**< Mode ENABLED for TRNG_CORECLKCONTROL */
#define _TRNG_CORECLKCONTROL_CORECLKDIS_DISABLED     0x00000001UL                                     /**< Mode DISABLED for TRNG_CORECLKCONTROL */
#define TRNG_CORECLKCONTROL_CORECLKDIS_DEFAULT       (_TRNG_CORECLKCONTROL_CORECLKDIS_DEFAULT << 0)   /**< Shifted mode DEFAULT for TRNG_CORECLKCONTROL */
#define TRNG_CORECLKCONTROL_CORECLKDIS_ENABLED       (_TRNG_CORECLKCONTROL_CORECLKDIS_ENABLED << 0)   /**< Shifted mode ENABLED for TRNG_CORECLKCONTROL */
#define TRNG_CORECLKCONTROL_CORECLKDIS_DISABLED      (_TRNG_CORECLKCONTROL_CORECLKDIS_DISABLED << 0)  /**< Shifted mode DISABLED for TRNG_CORECLKCONTROL */
#define _TRNG_CORECLKCONTROL_CORECLKPRESC_SHIFT      4                                                /**< Shift value for TRNG_CORECLKPRESC */
#define _TRNG_CORECLKCONTROL_CORECLKPRESC_MASK       0x70UL                                           /**< Bit mask for TRNG_CORECLKPRESC */
#define _TRNG_CORECLKCONTROL_CORECLKPRESC_DEFAULT    0x00000000UL                                     /**< Mode DEFAULT for TRNG_CORECLKCONTROL */
#define TRNG_CORECLKCONTROL_CORECLKPRESC_DEFAULT     (_TRNG_CORECLKCONTROL_CORECLKPRESC_DEFAULT << 4) /**< Shifted mode DEFAULT for TRNG_CORECLKCONTROL */

/** @} */
/** @} End of group EFM32GG12B_TRNG */
/** @} End of group Parts */
#ifdef __cplusplus
}
#endif

